In [2]:
import pandas as pd
import matplotlib.pyplot as plt
url = (
    "http://biostat.mc.vanderbilt.edu/"
    "wiki/pub/Main/DataSets/titanic3.xls"
)
df = pd.read_excel(url)

In [3]:
import janitor as jn
Xbad = pd.DataFrame(
    {
        "A": [1, None, 3],
        "  sales numbers ": [20.0, 30.0, None],
    }
)
jn.clean_names(Xbad)

     a  _sales_numbers_
0  1.0             20.0
1  NaN             30.0
2  3.0              NaN

In [4]:
def clean_col(name):
    return (
        name.strip().lower().replace(" ", "_")
    )
Xbad.rename(columns=clean_col)

     a  sales_numbers
0  1.0           20.0
1  NaN           30.0
2  3.0            NaN

In [5]:
jn.coalesce(
    Xbad,
    columns=["A", "  sales numbers "],
    new_column_name="val",
)

    val
0   1.0
1  30.0
2   3.0

In [6]:
Xbad.fillna(10)

      A    sales numbers
0   1.0              20.0
1  10.0              30.0
2   3.0              10.0

In [7]:
jn.fill_empty(
    Xbad,
    columns=["A", "  sales numbers "],
    value=10,
)

      A    sales numbers
0   1.0              20.0
1  10.0              30.0
2   3.0              10.0

In [8]:
df.isna().any().any()

True